Revit 2027 API
VertexPosition Constructor
 Constructs the vertex from a point.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VertexPosition(
	XYZ position
)
Public Sub New (
	position As XYZ
)
public:
VertexPosition(
	XYZ^ position
)
new :
        position : XYZ -> VertexPosition
Parameters
position XYZ
 The vertex's position.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
VertexPosition Class
Autodesk.Revit.DB.DirectContext3D Namespace